app/controllers/admin/customers_controller.rb

  def index
    @customers = Customer.all
    @customers = Customer.page(params[:page]).per(1)
---
SELECT  "customers".* FROM "customers" LIMIT ? OFFSET ?  [["LIMIT", 1], ["OFFSET", 0]]
SELECT COUNT(*) FROM "customers"

  def update
    @customer = Customer.find(params[:id])
    @customer.update(customer_params)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2022-04-24 10:08:03.940909"], ["id", 2]]