app/controllers/admin/homes_controller.rb

SELECT "orders".* FROM "orders"
SELECT  "orders".* FROM "orders" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "orders"
---
  def top
    @orders = Order.all
    @orders = Order.page(params[:page]).per(10)