app/controllers/admin/items_controller.rb

SELECT "items".* FROM "items"
---
  def index
    @item = Item.all

INSERT INTO "items" ("name", "image_id", "introduction", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)
    @item.save

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "items" SET "image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image_id", "cc75d193baded6ffda6553c94b801db76800d993f7e8fb2c4048994c7bac"], ["introduction", "おいしそう"], ["updated_at", "2022-04-04 15:08:41.929148"], ["id", 1]]
---
  def update
    @item = Item.find(params[:id])
    @item.update(item_params)