app/controllers/admin/orders_controller.rb

  def show
    @order = Order.find(params[:id])
    @order.postage = "800"
    @total = 0
    @order_items = @order.order_items
    @order_items.each do |order_item|
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 10]]