app/views/admin/orders/show.html.erb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <%= link_to admin_customer_path(@order.customer.id) do %>
        <%= @order.customer.first_name + @order.customer.last_name %>