app/views/admin/homes/top.html.erb

        </td>
        <td><%= order.customer.first_name + order.customer.last_name %></td>
        <% total = 0 %>
        <% order.order_items.each do |order_item| %>
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders"
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]