app/controllers/public/cart_items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    cart_item = CartItem.find(params[:id])