app/controllers/public/customers_controller.rb

  def update
    @customer = current_customer
    if  @customer.update(customer_params)
---
UPDATE "customers" SET "address" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["address", "静岡県静岡市葵区2222"], ["updated_at", "2022-04-28 09:44:21.083877"], ["id", 1]]

  def destroy
    @customer = current_customer
    @customer.update(is_active: false)
---
UPDATE "customers" SET "is_active" = ?, "updated_at" = ? WHERE "customers"."id" = ?  [["is_active", 0], ["updated_at", "2022-04-28 12:07:50.148004"], ["id", 1]]