app/controllers/public/homes_controller.rb

SELECT  "items".* FROM "items" ORDER BY id DESC LIMIT ?  [["LIMIT", 4]]
---
  def top
    @items = Item.all
    @items = Item.order('id DESC').limit(4)