app/controllers/public/items_controller.rb

SELECT "items".* FROM "items"
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "items" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 1], ["OFFSET", 0]]
---
  def index
    @items = Item.all
    @item = Item.page(params[:page]).per(1)