app/controllers/public/orders_controller.rb

SELECT  1 AS one FROM "addresses" WHERE "addresses"."name" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "orders" ("customer_id", "postal_code", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["customer_id", 1], ["postal_code", "4455111"], ["address", "静岡県浜松市"], ["created_at", "2022-04-19 18:15:29.052231"], ["updated_at", "2022-04-19 18:15:29.052231"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
---
  def comfirm
    @order = Order.new(order_params)
    if params[:order][:address_id] == "1"
      @order.name = current_customer.first_name + current_customer.last_name
      @order.address = current_customer.address
      @order.postal_code = current_customer.postal_code

    elsif  params[:order][:address_id] == "2"
      if Address.exists?(name: params[:order][:registered])
        @order.name = Address.find(params[:order][:registered]).name
        @order.addresd_number = Address.find(params[:order][:registered]).address
      end
    elsif params[:order][:address_id] == "3"
      @address_new = current_customer.orders.new
      @address_new.postal_code = params[:order][:postal_code]
      @address_new.address = params[:order][:address]
      @address_new.name = params[:order][:name]
      if @address_new.save
      else redirect_to new_order_path
      end
    end
    @cart_items = current_customer.cart_items.all
    @order.postage = "800"
    @total = 0
    @cart_items.each do |cart_item|

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 1]]
INSERT INTO "orders" ("customer_id", "postal_code", "address", "name", "postage", "total_payment", "payment_method", "salesorder", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."customer_id" = ?  [["customer_id", 2]]
INSERT INTO "order_items" ("item_id", "order_id", "price", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["item_id", 3], ["order_id", 21], ["price", 2400], ["amount", 1], ["created_at", "2022-04-26 08:24:07.238744"], ["updated_at", "2022-04-26 08:24:07.238744"]]
DELETE FROM "cart_items" WHERE "cart_items"."id" = ?  [["id", 22]]
---
  def create
    @cart_items = current_customer.cart_items.all
    @order = current_customer.orders.new(order_params)
    @order.salesorder = 0
    if @order.save
      @cart_items.each do |cart|
      @order_item = OrderItem.new
      @order_item.item_id = cart.item_id
      @order_item.order_id = @order.id
      @order_item.amount = cart.amount
      @order_item.price = cart.item.price
      @order_item.save
    end
    redirect_to orders_complete_path
    @cart_items.destroy_all