app/views/public/orders/new.html.erb

      <p class="mb-0"><%= f.radio_button :address_id, 2  %> <%= f.label :address_id_2, "登録済住所から選択" %> </p>
      <p class="mb-0 ml-2"><%= f.select :address_select, options_from_collection_for_select(Address.all, :id, :full_address) %></p>
---
SELECT "addresses".* FROM "addresses"